#encoding=utf-8
from __future__ import unicode_literals

LIFE    = 10
SPORT   = 11
HEALTHY = 12
KITCHEN = 13
SECURITY= 14
OTHER   = 99999

KEYS = {
    LIFE: ["插座","开关","防丢","灯","窗帘","家电","家居","马桶","电饭煲","水杯","路由","安防","监控","水壶","咖啡","耳机","眼镜","生活","手环","电视","手表","腕表","手镯","报警","节能","家中","手腕","遥控器","POS机","净化","打印机","移动电源","名片","戒指","沐浴","加湿器","电动车","牙刷","充电","办公桌","床"],

    SPORT: ["耳机","眼镜","头盔","跑步机","xbox","ps","无人","游戏","gopro","运动","娱乐","视频","音乐","高清","手表","腕表","手镯","手环","手势","遥控器","玩耍","相机","影像","光圈","盒子","戒指","飞行","摄像机","相框","意念","绘画","跳舞","机器人","充电宝","气压","光学技术","手机壳","充电","镜头","旅行","自行车","车","滑板","电影"],

    HEALTHY: ["健康","医疗","血糖","血压","心跳","心率","医生","心电","智能水壶","药","温度计","体重","睡眠","净化","肌肤","体温","婴儿","口罩","流感","病毒","加湿器","牙刷","监护器","奶瓶"],

    KITCHEN: ["厨房","煮","炒","煎","炸","蒸","咖啡"],

    SECURITY: ["监控","安防","报警","警报","监视","隐私","求救","SOS","门锁"]
}

NAMES = {
    LIFE : u"智能生活",
    SPORT: u"运动娱乐",
    HEALTHY: u"健康医疗",
    KITCHEN: u"智能厨房",
    SECURITY: u"智能安全",
}

def getTags(content):
    """
    给content打标签，默认有life标签
    """
    tags = []
    for key in KEYS.keys():
        for value in KEYS[key]:
            if content.find(value) >= 0:
                tags.append((key, NAMES[key]))
                break
    if len(tags) == 0:
        tags.append((LIFE, NAMES[LIFE]))

    return tags